[
  {
    "slug": "the-lonely-path",
    "title": "The Lonely Path",
    "topic": "Woman",
    "content": "She walks down the lonely path,\nNo one to wipe the tears in her heart,\nNo one to walk along with her,\nAnd soothe the fears that plague her...\n\nShe looks at life through her broken heart,\nMaking everything grey and dark,\nAlone, with her life changed forever,\nStarting life anew on nothing, but a prayer....\n\nLife is never ending, and so she walks on,\nHoping for a better tomorrow, she walks into the dawn.\nSomeday, maybe this path will not be lonely for her again,\nBut she'll never forget this lonely walk and this pain."
  },
  {
    "slug": "Bubbles",
    "title": "Bubbles",
    "topic": "Children",
    "content": "He throws silly paper balls at her\nThen chortling with joy, falls over her\nShe's tired but just can't get angry with him\nLoving the laughter, and the eyes twinkling\n\nHis laughter surrounding her like water bubbles\nSoft and delicate, making her forget her troubles\nA low sweet laugh, that fills her heart to bursting\nMaking her feel that the world is the colour of spring\n\nUsed to the grime of life, this happiness scares her\nBut her son wipes away the grime with a tiny ball of paper\nOuch! she tries to dodge another paper ball in vain\nAnd the bubbles surrounded her again…"
  },
  {
    "slug": "I am in love",
    "title": "I am in love",
    "topic": "Life",
    "content": "The cool air on my face in the morning\nA song in my ears that's positively rocking\nThe memory of my sleeping son, smiling\nWhen I kissed him goodbye this morning\n\nMy heart lifts, and my soul smiles\n\nI spend the day in work, and compete against myself\nProud of my work, irrespective of its significance\nProductivity, utilization, performance numbers sway\nBattles lost and won, lil triumphs pepper my day\n\nMy heart lifts, and my soul smiles (although a lil tired this time)\n\nI anticipate an evening in my lil one's presence\nMusic, playfulness and nothing of any consequence\nWatching movies late night or just sleeping away\nTo awake another day, and hopefully repeat today\n\nMy heart lifts, and my soul smiles\n\nI am in love with today. I am in love with life\nI hope this love affair lasts a lifetime!"
  },
  {
    "slug": "dreaming-of-love",
    "title": "Dreaming of love",
    "topic": "Life",
    "content": "Dreaming of a love that her heart desires\nA blissful sweetness that envelops the world\nIn its golden... warm... honeyed languor\nAn enchanting, exciting, electric presence\nMaking her heart float in its incense\nA safe haven that is her anchor\nAs she charts stormy, choppy waters\nTogether discovering the worlds spoils\nOr staying at home, with a warm fire\nIt can be all that and a lot more\nWith the one that shares her soul\nDreaming of a love that her heart desires..."
  },
  {
    "slug": "the-master",
    "title": "The master",
    "topic": "Woman",
    "content": "At first it was an open fearful struggle\nLearning the skills from the masters\nFearfully practicing these skills brought\nSweat, fear and the master's angry retorts\nAs time changed, shifting around her\nThe struggles turned a strange corner\nFear was shoved behind hidden walls\nAs she worked with a fake, calm façade\nBy and by the world accepted freely\nThis fake outward calm as reality\nAnd suddenly she understood\nWhat lay beneath the master's hood\nThey, the masters, didn't know it all\nThey only conquered their fluttering heart\nSo with time, familiarity re-placed fear\nAnd she became one of them. A fearless Master!"
  },
  {
    "slug": "something",
    "title": "Something",
    "topic": "Life",
    "content": "Something flutters ... rises up,\nStarts taking form and then stops\nDying off into the distant dusk\nA phantom in the settling dust\nIts existence proven by\nThe melancholy left behind"
  },
  {
    "slug": "wait",
    "title": "Wait",
    "topic": "Life",
    "content": "Those who trampled over you are long forgotten\nNo not forgotten... just not important\nSo what hurts so much, still?\nMaking it hard to breathe life in\nIt's not the memory of the past,\nBut the wait for the future... at last\nTelling yourself to wait, wait for your day...\nIt will be here ... some day\nWait... wait for your day"
  },
  {
    "slug": "wishes-and-prayers",
    "title": "Wishes and Prayers",
    "topic": "Love",
    "content": "he believes in the power of wishes\nIn healing laughter and true love's kisses\nWaiting for her love to find her, one day\nSighing in sweet anticipation she prays..."
  },
  {
    "slug": "nothing-at-all",
    "title": "Nothing at All",
    "topic": "Life",
    "content": "The world goes about its business, quietly\nSearching in the cupbooard of my memory\nI strive to ferret out one pure strand\nof raw emotion and come up with an empty hand\nnothing bursts with joy or aches with unseen wounds...\nnothing at all... isn't that wonderful?"
  },
  {
    "slug": "wait-wait",
    "title": "Wait... Wait...",
    "topic": "Resilience",
    "content": "Pummelled down, fists flying left and right\nBlack and blue and aching all over from the fight\nNo! don't hit back... hold your breath and wait\nwait... wait... wait... No!...No!... not yet... wait\n\nLet flames lick your lungs...as your breath burns\nCalmly the clock ticks along... and the wheels turn...\nNow!... it's your time, don't wait another second\nLunge forward and hit hard... don't miss a single shot\n\nNow the fists fly again, with blinding might\nRunning the enemy to the ground in a flash of light\nGloriously victorious he gets up from the mess\nThe victor walks away... without looking back"
  },
  {
    "slug": "happy-first-new-year-son",
    "title": "Happy First New Year Son!",
    "topic": "Children",
    "content": "A red balloon flies across a blue sky\nAll out of breath chasing a butterfly\nDirt of the playground on his jacket\nHe falls and gets up to play again\n\nCold wind blowing in his face, lifting his hair\nThe hot sun taking bite out of the cold air\nSliding off the slides and see saws\nMaking new friends and shaking hands\n\nHappily playing with his new friends\nAs his smiling mother watches, from the bench\nA good day, this, the last day of the year\nA new day and new year await you tomorrow!\n\nNew year, new days, new possibilities…\nNew bedtime stories, new discoveries…\nA new world awaits you everyday!\nA happy new year to you my son!\n\n~Love\nMom"
  },
  {
    "slug": "kitna-meetha-tha-bachpan-ka-sapna",
    "title": "कितना मीठा था बचपन का सपना…",
    "topic": "Children",
    "content": "More than a poem this is a memory of my childhood. Having spent my early childhood in UP, a region dominated by hindi speaking population, I can't help but write in hindi about my childhood. Writing about it in english kind of takes away from the nostalgia. So over to my nostalgic memories…\n\nनानी की उँगलियों से बालों मे तेल लगवाना\nसर्दी की धूप मे सूखती रजाई पे सो जाना\nरात को अंगीठी की सेक मे कहानियाँ सुनना\nसुबह के कोहरे मे रजाई से बाहर ना निकलना\nकितना मीठा था बचपन का सपना…\n\nस्कूल खुलते ही गर्मी की छुट्टियों का इंतज़ार करना\nनानी के घर जाने से ज्यादा ट्रेन मे बैठने की खुशियाँ\nदोस्तों के साथ पत्थर मार के आम तोड़ना\nमीठे तरबूज़ खाके खुश हो जाना\nकितना मीठा था बचपन का सपना…\n\nबारी बारी दोस्तुत की साइकिल चलाना\nछोटी-छोटी बातों पे रूठ के रोना\nवो लड़ना झगड़ना और मनाना\nअपनी ही गुड़िया की शादी करके उदास हो जाना\nकितना मीठा था बचपन का सपना…"
  },
  {
    "slug": "waqt-ka-ek-katara",
    "title": "वक्त का एक कतरा",
    "topic": "Life",
    "content": "वक्त का एक कतरा\nदर्द को अपने मे समाये हुए\nसमय की हथेली पे ठहेरा\nबस गिरने को है हाथों से\n\nअगले पल की चौखट पे खड़ी मैं सोचती रह गई\nकि फिसलने दूँ हाथों से\nया संजो लूं पलको में\nवक्त का वो कतरा…"
  },
  {
    "slug": "majhdhar",
    "title": "मझधार",
    "topic": "Life",
    "content": "डर लगता है समुन्दर की गहराइयों से\nसाहिल तो कब का छूट गया अंधेरों मे\nनील ही नील है समुन्दर और आसमान में\nमझधार मे भूलती हुई समुन्दर के थपेडों में\nनील जहाँ मे आगे बढ़ने से डरती हूँ\nसाहिल की परछाई का सहारा ढूंढती हूँ"
  },
  {
    "slug": "she-loves-that-loving-feeling",
    "title": "She loves that loving feeling!",
    "topic": "Children",
    "content": "She loves that loving feeling!\nWashing over her, like a warm wave\ndrowning her heart in its wake\nlasting but a few moments in time\nor moments that last a lifetime?\n\nOh those moments of sunshine and bliss\nwhen he offers his cheek for a sweet kiss\nor wraps his arms around her, crying mummy\nor falls asleep on her shoulder, tenderly\n\n'tis love that she is feeling,\nand oh! she loves that loving feeling!"
  },
  {
    "slug": "sticks-and-stones",
    "title": "Sticks and stones",
    "topic": "Children",
    "content": "Tearing across the playground, chasing a butterfly\nhis eyes land on something glinting in the sunlight\nHe picks it up, holding it this way then that\nA wobbly shaped stone, coloured blue and black\n\nOh! he is going to be rich, its a treasure … to add to his treasure chest,\nits so precious!\nhe runs home, and quietly retrieves a box\nhidden in his little drawer, under his socks\n\nThe box holds his precious posessions\na medley of different shapes and hues\nall sticks and stones treasured for so long\ntrophies of his forays into the playground\n\nHis heart blooms, as he surveys his treasures\nadding the latest stone to the pile with pleasure\nhow wonderfull, he is as rich as a king\nor perhaps richer than all the kings!\n\nWatching from the doorway she smiles\noh! her sweet and innocent child\nHer little prince, surveying his kingdom\nhis little treasure of sticks and stones"
  },
  {
    "slug": "tatters",
    "title": "Tatters",
    "topic": "Life",
    "content": "Something heavy settles in her chest again\nA weight that doesn't ever go away…\nTightness around her beautiful lips and heart\nTears in her throat that just don't fall\n\nThe pain of the past, growing in front of her eyes\nEveryday the half empty glass that is her life\nIt will never be over or a long forgotten past\nNo matter how much she fools herself… Alas!\n\nPatches that she stitches to cover the tears\nIn the fabric of her life… hiding her despair\nThe fabric is torn and so it will remain…\nThe tatters telling a story of loss and pain"
  },
  {
    "slug": "stumbling",
    "title": "Stumbling",
    "topic": "Children",
    "content": "He toddles along in front of her eyes\nHopping and jumping, as she watches with a smile\nSuddenly, his foot catches without any warning\nHe spreads out his hand, as he is falling\n\nAs she watches him tottering and stumbling\nHer heart skips a beat… and then starts pounding\nShe reaches out a hand… but stops herself mid way\nAs he straightens up and moves along on the pathway\n\nShe let out a deep breath, as quietly as she could,\nAh! the pain and the understanding that is motherhood\nKnowing she cant always protect her little son\nOnly allow him to learn…learn with every fall and stumble"
  },
  {
    "slug": "i-am-looking",
    "title": "I am looking",
    "topic": "Woman",
    "content": "I am looking… looking for\n\nEyes that look at me like they look at no one else\nA smile that deepens when it turns my way\n\nThe one who seeks me out of a crowded floor\nWho believes that I am worth fighting for\n\nSee the love and strength that I can share\nWho has the strength to love and to care\n\nWho takes on my whole life with all its little packages\nTake it with pleasure… not a favour of extra baggage\n\nOne who holds on with me in a storm\nA soul mate, loved and lost in lifetimes long gone\n\nI am looking for….\nLady Luck to introduce me to the one, who thinks I am worth the trouble\nThe gumption to hold on to him, when he does take the trouble"
  },
  {
    "slug": "butterfly-season",
    "title": "Butterfly season",
    "topic": "Woman",
    "content": "As she walks out into the sun\nHer eyes following the fountain\nWater shimmering in the brilliant glaze\nLike blue green sapphires rising in the spray\n\nShe walks further into the light\nA small flutter of colour catches her eye\nShe holds her breath watching the summer sky\nAs the sun catches the brilliant colours of a butterfly\n\nThere is another one flitting round the yellow flower\nFollowed blithely by several more, looking spectacular\nShe has never seen so many butterflies in her life\nAnd she knows it is time to acknowledge the sign\n\nThe dark clouds are lifting finally\nAs life reawakens to a lilting melody\nA dark and painful past is ending\nAnd she breathlessly awaits a new beginning"
  }
]